/*
	Текущее показание электронных часов m часов (0 ≤ 𝑚 ≤ 23), 
	n минут (0 ≤ 𝑛 ≤ 59), k секунд (0 ≤ 𝑘 ≤ 59). Какое время будут
	показывать часы через p часов q минут r секунд (p>0, q>0, r>0)?

	Тестовые данные:
	Текущее время	Прошедшее время	Итоговое время
	1:02:03			4:05:06			5:07:09
	23:59:59		23:59:59		23:59:58
*/
#include <stdio.h>

int main()
{
	//Добавляем переменные
	int m, n, k, p, q, r, curTime, addTime;

	//Ввод текущего времени
	printf("Сейчас часов: ");
	scanf("%d", &m);
	printf("Сейчас минут: ");
	scanf("%d", &n);
	printf("Сейчас секунд: ");
	scanf("%d", &k);
	//Ввод прошедшего времени
	printf("Прошло часов: ");
	scanf("%d", &p);
	printf("Прошло минут: ");
	scanf("%d", &q);
	printf("Прошло секунд: ");
	scanf("%d", &r);
	
	//Перевод времени в секунды
	curTime = m * 3600 + n * 60 + k;
	addTime = p * 3600 + q * 60 + r;

	//Расчёт полученного времени в секундах
	curTime = curTime + addTime; 
	
	//Разбиение полученного времени по разрядам
	m = curTime / 3600;
	n = curTime / 60 - (m * 60);
	k = curTime - (n * 60) - (m * 3600);

	m = m % 24; //Вычитание лишних суток при переполнении

	//Вывод полученного времени
	printf("\nТекущее время %d:%1.2d:%1.2d\n", m, n, k);

	return 0;
}
